
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>虚拟机 · JobNoteBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Design_pattern.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../info.html">
            
                <a href="../info.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../base/">
            
                <a href="../base/">
            
                    
                    计算机基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="./">
            
                <a href="./">
            
                    
                    java部分
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="jvm.html">
            
                <a href="jvm.html">
            
                    
                    虚拟机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="Design_pattern.html">
            
                <a href="Design_pattern.html">
            
                    
                    设计模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="Proxy.html">
            
                <a href="Proxy.html">
            
                    
                    代理设计模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="Net.html">
            
                <a href="Net.html">
            
                    
                    网络
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Linux/">
            
                <a href="../Linux/">
            
                    
                    Linux部分
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../Linux/section.html">
            
                <a href="../Linux/section.html">
            
                    
                    linux1
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../android_base/">
            
                <a href="../android_base/">
            
                    
                    Android基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../android_advance/">
            
                <a href="../android_advance/">
            
                    
                    Android进阶
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="../android_advance/section1.html">
            
                <a href="../android_advance/section1.html">
            
                    
                    Android1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="../android_advance/stability/">
            
                <a href="../android_advance/stability/">
            
                    
                    稳定性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="../android_advance/perf/info.html">
            
                <a href="../android_advance/perf/info.html">
            
                    
                    性能优化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../Interview/">
            
                <a href="../Interview/">
            
                    
                    常见面试题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.8.1" data-path="Interview.html">
            
                <a href="Interview.html">
            
                    
                    java面试题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8.2" >
            
                <span>
            
                    
                    Android面试题
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.8.3" data-path="../Interview/SoftQuestion.html">
            
                <a href="../Interview/SoftQuestion.html">
            
                    
                    软性面试问题
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="../Faq.html">
            
                <a href="../Faq.html">
            
                    
                    常见问题
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >虚拟机</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="jvm&#x865A;&#x62DF;&#x673A;">jvm&#x865A;&#x62DF;&#x673A;</h3>
<p><img src="https://pic4.zhimg.com/80/v2-abefb713de46f1e6dd241246c0afe263_1440w.jpg" alt="&#x5185;&#x5B58;&#x7ED3;&#x6784;">
<strong>&#x5806;(Heap)</strong>: &#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x3002;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x4EE5;&#x53CA;&#x6570;&#x7EC4;&#x90FD;&#x8981;&#x5728;&#x5806;&#x4E0A;&#x5206;&#x914D;&#x3002;&#x56DE;&#x6536;&#x5668;&#x4E3B;&#x8981;&#x7BA1;&#x7406;&#x7684;&#x5BF9;&#x8C61;&#x3002;<br><strong>&#x65B9;&#x6CD5;&#x533A;&#xFF08;Method Area&#xFF09;</strong>&#xFF1A;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x3002;&#x5B58;&#x50A8;&#x7C7B;&#x4FE1;&#x606F;&#x3001;&#x5E38;&#x91CF;&#x3001;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x3001;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;(JIT)&#x540E;&#x7684;&#x4EE3;&#x7801;&#x3002; 
<strong>&#x65B9;&#x6CD5;&#x6808;&#xFF08;JVM Stack&#xFF09;</strong>&#xFF1A;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x3002;&#x5B58;&#x50A8;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x3001;&#x64CD;&#x4F5C;&#x6808;&#x3001;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x3001;&#x65B9;&#x6CD5;&#x51FA;&#x53E3;&#xFF0C;&#x5BF9;&#x8C61;&#x6307;&#x9488;&#x3002;
<strong>&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#xFF08;Native Method Stack&#xFF09;</strong>&#xFF1A;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x3002;&#x4E3A;&#x865A;&#x62DF;&#x673A;&#x4F7F;&#x7528;&#x5230;&#x7684;Native &#x65B9;&#x6CD5;&#x670D;&#x52A1;&#x3002;&#x5982;Java&#x4F7F;&#x7528;c&#x6216;&#x8005;c++&#x7F16;&#x5199;&#x7684;&#x63A5;&#x53E3;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x4EE3;&#x7801;&#x5728;&#x6B64;&#x533A;&#x8FD0;&#x884C;&#x3002;
<strong>&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF08;Program Counter Register&#xFF09;</strong>&#xFF1A;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x3002;&#x6709;&#x4E9B;&#x6587;&#x7AE0;&#x4E5F;&#x7FFB;&#x8BD1;&#x6210;PC&#x5BC4;&#x5B58;&#x5668;&#xFF08;PC Register&#xFF09;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x6240;&#x6267;&#x884C;&#x7684;&#x5B57;&#x8282;&#x7801;&#x7684;&#x884C;&#x53F7;&#x6307;&#x793A;&#x5668;&#x3002;&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x6761;&#x8981;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x3002;</p>
<h4 id="&#x4E00;&#x53E5;&#x8BDD;&#x7B80;&#x5355;&#x4E86;&#x89E3;&#x5806;&#x548C;&#x65B9;&#x6CD5;&#x533A;">&#x4E00;&#x53E5;&#x8BDD;&#x7B80;&#x5355;&#x4E86;&#x89E3;&#x5806;&#x548C;&#x65B9;&#x6CD5;&#x533A;</h4>
<p>&#x5806;&#x548C;&#x65B9;&#x6CD5;&#x533A;&#x662F;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5176;&#x4E2D;&#x5806;&#x662F;&#x8FDB;&#x7A0B;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x4E00;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61; (&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x90FD;&#x5728;&#x8FD9;&#x91CC;&#x5206;&#x914D;&#x5185;&#x5B58;)&#xFF0C;&#x65B9;&#x6CD5;&#x533A;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x5DF2;&#x88AB;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x4FE1;&#x606F;&#x3001;&#x5E38;&#x91CF;&#x3001;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x3001;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x4EE3;&#x7801;&#x7B49;&#x6570;&#x636E;&#x3002;</p>
<h4 id="&#x5F3A;&#x5F15;&#x7528;&#xFF0C;&#x5F31;&#x5F15;&#x7528;&#xFF0C;&#x8F6F;&#x5F15;&#x7528;&#xFF0C;&#x865A;&#x5F15;&#x7528;">&#x5F3A;&#x5F15;&#x7528;&#xFF0C;&#x5F31;&#x5F15;&#x7528;&#xFF0C;&#x8F6F;&#x5F15;&#x7528;&#xFF0C;&#x865A;&#x5F15;&#x7528;</h4>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5177;&#x6709;&#x5F3A;&#x5F15;&#x7528;&#xFF0C;&#x90A3;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x751F;&#x6D3B;&#x7528;&#x54C1;&#xFF0C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x7EDD;&#x4E0D;&#x4F1A;&#x56DE;&#x6536;&#x5B83;&#x3002;&#x5F53;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;&#xFF0C;Java &#x865A;&#x62DF;&#x673A;&#x5B81;&#x613F;&#x629B;&#x51FA; OutOfMemoryError &#x9519;&#x8BEF;&#xFF0C;&#x4F7F;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#x7EC8;&#x6B62;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x9760;&#x968F;&#x610F;&#x56DE;&#x6536;&#x5177;&#x6709;&#x5F3A;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x89E3;&#x51B3;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x53EA;&#x5177;&#x6709;&#x8F6F;&#x5F15;&#x7528;&#xFF0C;&#x90A3;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E;&#x53EF;&#x6709;&#x53EF;&#x65E0;&#x7684;&#x751F;&#x6D3B;&#x7528;&#x54C1;&#x3002;&#x5982;&#x679C;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x8DB3;&#x591F;&#xFF0C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x5C31;&#x4E0D;&#x4F1A;&#x56DE;&#x6536;&#x5B83;&#xFF0C;&#x5982;&#x679C;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;&#x4E86;&#xFF0C;&#x5C31;&#x4F1A;&#x56DE;&#x6536;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x3002;&#x53EA;&#x8981;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x6CA1;&#x6709;&#x56DE;&#x6536;&#x5B83;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x3002;&#x8F6F;&#x5F15;&#x7528;&#x53EF;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x5185;&#x5B58;&#x654F;&#x611F;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x3002;
&#x8F6F;&#x5F15;&#x7528;&#x53EF;&#x4EE5;&#x548C;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x961F;&#x5217;&#xFF08;ReferenceQueue&#xFF09;&#x8054;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x8F6F;&#x5F15;&#x7528;&#x6240;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;JAVA &#x865A;&#x62DF;&#x673A;&#x5C31;&#x4F1A;&#x628A;&#x8FD9;&#x4E2A;&#x8F6F;&#x5F15;&#x7528;&#x52A0;&#x5165;&#x5230;&#x4E0E;&#x4E4B;&#x5173;&#x8054;&#x7684;&#x5F15;&#x7528;&#x961F;&#x5217;&#x4E2D;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x53EA;&#x5177;&#x6709;&#x5F31;&#x5F15;&#x7528;&#xFF0C;&#x90A3;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E;&#x53EF;&#x6709;&#x53EF;&#x65E0;&#x7684;&#x751F;&#x6D3B;&#x7528;&#x54C1;&#x3002;&#x5F31;&#x5F15;&#x7528;&#x4E0E;&#x8F6F;&#x5F15;&#x7528;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF1A;&#x53EA;&#x5177;&#x6709;&#x5F31;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x62E5;&#x6709;&#x66F4;&#x77ED;&#x6682;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;&#x5728;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x7EBF;&#x7A0B;&#x626B;&#x63CF;&#x5B83;&#x6240;&#x7BA1;&#x8F96;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E00;&#x65E6;&#x53D1;&#x73B0;&#x4E86;&#x53EA;&#x5177;&#x6709;&#x5F31;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4E0D;&#x7BA1;&#x5F53;&#x524D;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x8DB3;&#x591F;&#x4E0E;&#x5426;&#xFF0C;&#x90FD;&#x4F1A;&#x56DE;&#x6536;&#x5B83;&#x7684;&#x5185;&#x5B58;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x7531;&#x4E8E;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x662F;&#x4E00;&#x4E2A;&#x4F18;&#x5148;&#x7EA7;&#x5F88;&#x4F4E;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C; &#x56E0;&#x6B64;&#x4E0D;&#x4E00;&#x5B9A;&#x4F1A;&#x5F88;&#x5FEB;&#x53D1;&#x73B0;&#x90A3;&#x4E9B;&#x53EA;&#x5177;&#x6709;&#x5F31;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x3002;
&#x5F31;&#x5F15;&#x7528;&#x53EF;&#x4EE5;&#x548C;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x961F;&#x5217;&#xFF08;ReferenceQueue&#xFF09;&#x8054;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x5F31;&#x5F15;&#x7528;&#x6240;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;Java &#x865A;&#x62DF;&#x673A;&#x5C31;&#x4F1A;&#x628A;&#x8FD9;&#x4E2A;&#x5F31;&#x5F15;&#x7528;&#x52A0;&#x5165;&#x5230;&#x4E0E;&#x4E4B;&#x5173;&#x8054;&#x7684;&#x5F15;&#x7528;&#x961F;&#x5217;&#x4E2D;&#x3002;</p>
<p>&quot;&#x865A;&#x5F15;&#x7528;&quot;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x5F62;&#x540C;&#x865A;&#x8BBE;&#xFF0C;&#x4E0E;&#x5176;&#x4ED6;&#x51E0;&#x79CD;&#x5F15;&#x7528;&#x90FD;&#x4E0D;&#x540C;&#xFF0C;&#x865A;&#x5F15;&#x7528;&#x5E76;&#x4E0D;&#x4F1A;&#x51B3;&#x5B9A;&#x5BF9;&#x8C61;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4EC5;&#x6301;&#x6709;&#x865A;&#x5F15;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x548C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F15;&#x7528;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x53EF;&#x80FD;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;</p>
<p>&#x865A;&#x5F15;&#x7528;&#x4E0E;&#x8F6F;&#x5F15;&#x7528;&#x548C;&#x5F31;&#x5F15;&#x7528;&#x7684;&#x4E00;&#x4E2A;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF1A; &#x865A;&#x5F15;&#x7528;&#x5FC5;&#x987B;&#x548C;&#x5F15;&#x7528;&#x961F;&#x5217;&#xFF08;ReferenceQueue&#xFF09;&#x8054;&#x5408;&#x4F7F;&#x7528;&#x3002;&#x5F53;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x51C6;&#x5907;&#x56DE;&#x6536;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x5B83;&#x8FD8;&#x6709;&#x865A;&#x5F15;&#x7528;&#xFF0C;&#x5C31;&#x4F1A;&#x5728;&#x56DE;&#x6536;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x4E4B;&#x524D;&#xFF0C;&#x628A;&#x8FD9;&#x4E2A;&#x865A;&#x5F15;&#x7528;&#x52A0;&#x5165;&#x5230;&#x4E0E;&#x4E4B;&#x5173;&#x8054;&#x7684;&#x5F15;&#x7528;&#x961F;&#x5217;&#x4E2D;&#x3002;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5224;&#x65AD;&#x5F15;&#x7528;&#x961F;&#x5217;&#x4E2D;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x52A0;&#x5165;&#x4E86;&#x865A;&#x5F15;&#x7528;&#xFF0C;&#x6765;&#x4E86;&#x89E3;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x5C06;&#x8981;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#x7A0B;&#x5E8F;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x67D0;&#x4E2A;&#x865A;&#x5F15;&#x7528;&#x5DF2;&#x7ECF;&#x88AB;&#x52A0;&#x5165;&#x5230;&#x5F15;&#x7528;&#x961F;&#x5217;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x6240;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x88AB;&#x56DE;&#x6536;&#x4E4B;&#x524D;&#x91C7;&#x53D6;&#x5FC5;&#x8981;&#x7684;&#x884C;&#x52A8;&#x3002;</p>
<p>&#x7279;&#x522B;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E2D;&#x4E00;&#x822C;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x5F31;&#x5F15;&#x7528;&#x4E0E;&#x865A;&#x5F15;&#x7528;&#xFF0C;&#x4F7F;&#x7528;&#x8F6F;&#x5F15;&#x7528;&#x7684;&#x60C5;&#x51B5;&#x8F83;&#x591A;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x8F6F;&#x5F15;&#x7528;&#x53EF;&#x4EE5;&#x52A0;&#x901F; JVM &#x5BF9;&#x5783;&#x573E;&#x5185;&#x5B58;&#x7684;&#x56DE;&#x6536;&#x901F;&#x5EA6;&#xFF0C;&#x53EF;&#x4EE5;&#x7EF4;&#x62A4;&#x7CFB;&#x7EDF;&#x7684;&#x8FD0;&#x884C;&#x5B89;&#x5168;&#xFF0C;&#x9632;&#x6B62;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#xFF08;OutOfMemory&#xFF09;&#x7B49;&#x95EE;&#x9898;&#x7684;&#x4EA7;&#x751F;&#x3002;</p>
<h4 id="gc&#x7B97;&#x6CD5;&#xFF1A;">GC&#x7B97;&#x6CD5;&#xFF1A;</h4>
<p>&#x5BF9;&#x4E8E;&#x65B0;&#x751F;&#x4EE3;&#x91C7;&#x7528;&#x6807;&#x8BB0;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x8001;&#x5E74;&#x4EE3;&#x91C7;&#x7528;&#x6807;&#x8BB0;&#x6574;&#x7406;&#x7B97;&#x6CD5;&#x3002;</p>
<h4 id="&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF1A;">&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF1A;</h4>
<p>G1&#xFF1A;
<img src="https://imgconvert.csdnimg.cn/aHR0cDovL3BpY3R1cmUudGp0dWxvbmcudG9wL0cxJUU2JTk0JUI2JUU5JTlCJTg2JUU1JTk5JUE4LmpwZw" alt="G1"></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: java部分">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Design_pattern.html" class="navigation navigation-next " aria-label="Next page: 设计模式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"虚拟机","level":"1.4.1","depth":2,"next":{"title":"设计模式","level":"1.4.2","depth":2,"path":"Java/Design_pattern.md","ref":"Java/Design_pattern.md","articles":[]},"previous":{"title":"java部分","level":"1.4","depth":1,"path":"Java/README.md","ref":"Java/README.md","articles":[{"title":"虚拟机","level":"1.4.1","depth":2,"path":"Java/jvm.md","ref":"Java/jvm.md","articles":[]},{"title":"设计模式","level":"1.4.2","depth":2,"path":"Java/Design_pattern.md","ref":"Java/Design_pattern.md","articles":[]},{"title":"代理设计模式","level":"1.4.3","depth":2,"path":"Java/Proxy.md","ref":"Java/Proxy.md","articles":[]},{"title":"网络","level":"1.4.4","depth":2,"path":"Java/Net.md","ref":"Java/Net.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"JobNoteBook","gitbook":"*"},"file":{"path":"Java/jvm.md","mtime":"2022-08-31T04:09:36.623Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-08-31T06:58:16.716Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

